// pages/protocol/protocol.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    title:'商家入驻服务协议',
    content:'加入和使用购免单平台表明您已经阅读并同意使用购免单相关条款，在您注册成为购免单会员后，您的会员活动将会遵从本使用条款。如果您对本用户协议不认同，可以选择不加入和使用购免单平台的所有活动。\n本协议在您注册时由您与河南鹊而鸣实业有限公司共同缔结，按照中华人民共和国合同法以及其他相关法律法规的规定具有合同效力。\n本协议中协议双方合称协议方，河南鹊而鸣实业有限公司在协议中亦称为“购免单平台”，是一家总部设立在中国河南专门为入驻商户和消费者提供各类电子商务服务、商品和服务线上促销服务、线上导购信息、互联网线上广告内容以及其他基于商户和消费者为中心的各类增值服务的互联网服务公司(.上述服务将在购免单平台取得相关资质后开展)。\n一、协议内容及签署\n1、本协议内容包括协议正文及购免单平台已经发布的或将来可能发布的各类规则。所有已经发布的或者将来发布的有效规则为本协议不可分割的组成。除另行明确声明外，所有使用购免单的消费者、代理商公司、供应商以及任何提供的服务的主体均受本协议约束(消费者注册成功成为购免单平台会员用户)。但法律法规另有规定的除外。\n2、您在注册购免单会员账户(包括但不限于会员、商户等使用购免单平台的主体)时点击提交“阅读且同意本使用协议”即视为您与河南鹊而鸣实业有限公司就本协议达成一-致。您应当在使用购免单平台服务之前认真阅读全部协议内容并确保完全理解协议内容,如您对协议有任何疑问的，应拨打购免单公司咨询电话进行咨询。\n3、如果您不同意本协议的约定请立即停止相关注册程序。\n4、购免单平台直权根据需要不时地制订、修改以及公示本协议以及规则。变更后的协议、规则或者补充的协议内容二经公示立即生效。\n二、会员及账户管理\n1、申请资格\n首先注册时您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，依据相关法律规定.您的监护人应承担因此而导致的一切后果，在必要的法律规则前提下购免单平台也会向您及您的监护人索偿或者追偿。购免单平台发现有违反本电请规则的情况出现时,购免单平台有权立刻注销或者冻结相关账户，由此导致的一切法律后果均由注册人或者注册人的监护人承担责任。\n购免单平台作为一一个互联网电子商务服务平台对于审核注册人的民事行为能力心有余而力不足，鉴于此，购免单平台将一-切以及注册的用户视为您具备完全民事权利能力和完全民事行为能力。如有由于注册人隐满行为能力注册为购免单平台用户导致购免单平台、自身以及任何第三方遭受损失的，均由注册人以及注册人的监护人承担一切法律赔偿责任。\n2、账户以及相关信息\n在注册人注册购免单平台会员(无论是在购免单APP、小程序或者网站注册的会员)，在注册人完成同意本协议完成注册时，购免单平台将为您提供唯一的编码ID作为您在购免单平台享受权利、承担义务的唯一账户(以下简称账户)\n注册人可以对账户设置会员名和密码，通过该会员名密码或与该会员名密码关联的其它用户名密码(如有)登陆、使用购免单平台的服务。您设置的会员名不得违反法律法规，不得违反公序良俗，不得侵害他人的名誉权和个人隐私。购免单平台有权单方面判定注册人是否违反本条而禁止注册人注册相关的用户名或者对已注册的用户名进行冻结、删除或者其他停止服务的行为。\n您应对您的账户(会员名)和密码的安全，以及对通过您的账户(会员名)和密码实施的行为负责。除非经过购免单认可的程序以外，账户(会员名)和密码不得以任何方式转让、赠与或继承。在您的账户和密码遭遇不法侵害的情况下理解购免单平台重要对你的请求平取行动重要合理时间，购免单平台对在采取行动前已经产生的后果(包括但不限于您的任何损失)不承担任何责任。您认可您在注册、使用购免单平台服务过程中提供、形成的数据等相关信息的所有权及其他相关权利属于购免单平台，购免单平台有权使用上述信息。\n您理解，在现行法律法规的框架下，购免单平台有义务将您的相关账户信息或者账户活动告知和披露给的有权机构(包括公、检、法、国家安全机构等机构)。购免单平台也有权依据相关法律法规的规定将您侵害任何第三方的信息删除，在本侵权人履行正当程序的前提下，购免单平台有义务将相关信息提供给任何第三方。3、会员\n在注册者按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后注册者将成为购免单平台会员(亦称会员)。\n在注册时，您应当按照法律法规的实名制要求下，请按照注册页面的提示提供准确资料,以使相关信息做到真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，购免单平台有权向您发出询问及/或要求改正的通知，在通知未得到合理应答的前提下购免单平台有权做出删除相应资料并暂时停止账户的处理，购免单平台将对此不承担任何责任，您将承担因此产生的任何成本或支出。\n您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，如果因通过这些联系方式无法与您取得联系，导致您在使用购免单平台的任何服务过程中产生任何损失或增加费用的，均由该注册会员承担一切损失。\n您在使用购免单平台服务过程中，所产生的应纳税费，以及一切硬件、软件、服务、账户维持及其它方面的费用，均由实际注册人承担。如果按照法律法规规定购免单平台属于代扣代缴人的情况下，购免单平台将有权从您相关账户中优先扣除上述费用。\n对于被购免单平台账户冻结或者暂时停止帐户的会员，购免单平台将不再提供会员项目下的服务。\n3、会员\n在注册者按照注册页面提示填写信息、阅读并同意本协议并完成全部注册程序后注册者将成为购免单平台会员(亦称会员)。\n在注册时，您应当按照法律法规的实名制要求下，请按照注册页面的提示提供准确资料,以使相关信息做到真实、及时、完整和准确。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，购免单平台有权向您发出询问及/或要求改正的通知，在通知未得到合理应答的前提下购免单平台有权做出删除相应资料并暂时停止账户的处理，购免单平台将对此不承担任何责任，您将承担因此产生的任何成本或支出。\n您应当准确填写并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，如果因通过这些联系方式无法与您取得联系，导致您在使用购免单平台的任何服务过程中产生任何损失或增加费用的，均由该注册会员承担一切损失。\n您在使用购免单平台服务过程中，所产生的应纳税费，以及一切硬件、软件、服务、账户维持及其它方面的费用，均由实际注册人承担。如果按照法律法规规定购免单平台属于代扣代缴人的情况下，购免单平台将有权从您相关账户中优先扣除上述费用。\n对于被购免单平台账户冻结或者暂时停止帐户的会员，购免单平台将不再提供会员项目下的服务。\n三、购免单平台的服务:\n1、购免单平台会员(以下简称会员)可以通过参加购免单平台及其合作商户所举行的各种活动获得现金奖励、积分奖励(如有)、促销信息等各类购免单平台提供的服务。2、现金奖励是指购免单平台依据合作商户在购免单平台上的打折信息所计算的排队返现规则。现金奖励是否成功与商户是否设置打折比例、参与白吃计划的条件是否成熟以及商户是否参加购免单平台现金奖励计划等众多因素造成的。购免单平台及其商户不承诺所有参加获得的会员一定会获得现金奖励。\n所有参加现金奖励会员自愿遵守购免单的现金奖励的排队规则，该规则将体现在会员的微信小程序、App以及购免单网站(如有)中的现金奖励的规则说明中提示。现金排队奖励的排队速度与购免单合作商户在购免单后台设置的折扣比例、消费者消费金额大小、消费者消费速度以及合作商户是否参加购免单现金奖励计划有关。购免单平台有权依据商户参与购免单平台的各种促销活动中对排队的规则进行变动。购免单会员在参与所在商户促销活动的时候就已经认可各种排队规则，购免单平台和相关参与促销的商户有权按照会员等级、促销活动以及随机发布的各种排队规则改变相关的排队规则，购免单会员参与商户的促销活动即为同意购免单平台的排队规则。\n购免单平台中合作商户的营业款清算，由合作商户授权购免单平台委托有清算资质的银行或者机构进行，合作商户的营业款清算由合作商户发起后由相关银行或者机构进行清算。会员是否能够享受到现金奖励以及相关现金奖励的实现的速度均与购免单平台无关，与合作商户的促销力度以及所参与的促销活动有关。所有会员均可以放心消费，购免单平台现金清算服务由银行等有清算资质的机构承担。\n购免单会员应当确保其被退费的微信支付、支付宝或者银行卡账户的安全且未被冻结以及能够正常使用，现金奖励的条件成熟的情况下，将原路退回。如因为购免单会员账户的原因导致现金奖励无法原路退回到会员账户，相关购免单会员即自动放弃本次现金奖励。\n3、积分是会员通过参与、点击购免单平台及其合作商户、网站举办的各种活动及其设置的相应链接、页面或者按钮获得的一种权利，可以用于兑换购免单平台愿意提供的各类奖品和服务。购免单平台的积分仅适用于购免单平台及其合作商户举办的各种活动，并不构成会员任何形式的资产。\n4、会员应所获得的积分(如有)根据相应活动规则计入会员账户中。积分获得规则由各项具体活动(如有)详细规定，请您关注购免单平台的页面活动介绍。\n5、会员如果在购免单平台.上获得相关积分的，相关积分不能以买卖、赠与等其他任何形式转让他人。\n6、通过购免单及其合作商户所提供的任何服务，会员可在购免单平台允许的相关页面上发布交易信息、查询商品和服务信息、现金奖励的排队情况等信息。在购免单平台允许的范围内允许会员对于购免单合作商户进行评价，相关评价不得存在违反法律法规、政策以及侵犯他人名誉权的行为。购免单平台在任何情况下有权是否删除相关评价。\n7、购免单平台作为一个撮合消费者和线下商户进行线上交易的电子商务平台。会员在购免单平台享受服务的过程中发生交易纠纷时，会员或合作商户之间任一-方或双方共同提交购免单平台要求判定的，则购免单平台有权根据单方判断做出判定处罚，会员了解并同意接受购免单平台的判定对会员产生的相关法律效力。该决定将对您的纠纷具有约束力。购免单平台依据本条作出的任何判定均不得被认作会员或者合作商户认定其侵犯相关权利的证据和依据，会员以及合作商户不得因此而起诉购免单要求任何形式的赔偿和补偿，\n8、所有购免单会员了解并同意，购免单平台有权应政府部门(包括司法及行政部门)的要求，向其提供您在购免单平台填写的注册信息和交易纪录等政府部门或司法部门要求购免单平台提供的信息。\n依据互联网相关法律法规的规定,如您被他人投诉侵犯他人合法权益(包括但不限于知识产权、名誉权、隐私权、肖像权)，则购免单平台有权在初步判断的情况下，向权利人提供您必要的身份信息。一般情况下，购免单平台将在前述信息披露情况发生后没有任何法定义务时向您发出书面通知，如在相关法律法规规定的情况下，购免单将以您注册时使用的电子邮箱进行通知，如因邮箱地址的填写错误，先关后果有注册会员自行承担相关后果。四、购免单平台服务使用规范\n在使用购免单平台服务过程中，购免单会员应当承诺遵守下列使用规范:\n1、会员承诺其注册信息的正确性，由于注册信息的瑕疵或者错误产生的一切法律后果均由相关会员自行承担。\n2、如果会员提供给购免单平台的资料有变更，应当及时通知购免单平台做出相应的修改。\n3、购免单平台会员不得出现恶意注册恶意点击等行为。由于购免单平台的会员的恶意注册和恶意点击行为，购免单平台有权单方面判定会员的相关行为是否属于恶意注册和恶意点击，在购免单平台判定为恶意注册和恶意点击的情况下，购免单平台有权做出冻结账户、查封账户以及取消相关现金奖励资格等购免单平台任何合适的任何处罚规则。\n4、会员应及时使用自己的购免单平台账户中的积分(如有)。在没有特别说明的情况下，积分有效期为1年，从会员在各类活动中获得的积分(如有)进入会员的购免单帐户开始起算。超过有效期仍未及时兑换的，则此部分过期积分将逾期失效并作归零处理。\n5、会员超过两年无登陆记录，购免单平台具有注销该帐户的权利。\n6、所有会员承诺在使用购免单平台的服务过程中实施的所有行为均遵守国家法律、法规以及相关互联网政策，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反购免单在任何时间发布的各项规则。如果会员的任何行为违反上述承诺造成的一切法律后果由会员自行承担，如果给购免单平台造成任何损失，购免单平台有权对违反承诺的会员追责并且要求承担损失。\n8、购免单平台的合作商户应当，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。如果违反，购免单平台有权采取任何经过发布的相关处罚措施，包括但不限于停止相关服务。\n9、购免单会员不得以虚构或歪曲事实的方式不当评价购免单合作商户会员，不采取不正当方式制造或提高自身的会员等级。\n10、任何购免单会员不得在未经购免单事先书面同意的情况下，以复制、传播等任何方式使用购免单平台上的任何展示的资料。购免单会员的上述行为将被视为对购免单资源的盗取，购免单平台有权对相关用户采取停止服务的判定。\n11、购免单平台禁止会员存在以下行为，会员存在如下行为的，购免单平台有权追回会员账号及其关联账号(关联账户由购免单平台根据自身系统数据判定，判定依据包括但不限于会员登记信息、交易信息、第三方反馈信息、设备终端信息、IP地址等，下同)中已经给予的任何会员服务，情节严重可以直接注销会员账号，同时该会员必须承担由此给购免单平台带来的任何损失:a)购买产品后恶意取消订单;b)劫持流量;c)自买自卖;\nd)劫持其他用户的正常访问链接使其变成推广链接;\ne)骗取其他用户点击其设置的非购免单平台设置的链接;f)其他违反法律法规或者违反诚实信用、公平原则等公序良俗的行为，被购免单平台判定为违规的。\n12、购免单平台禁止各种针对购免单举办的现金奖励活动的作弊行为。对于查实的作弊行为,我们有权收回该账号停止服务并将相关的人员列入黑名单账户。作弊行为的判定标准和判定方式由购免单判定，会员认可购免单对于会员作弊行为的判定以及购免单平台发布的任何关于作弊行为的规则。\n13、会员不得使用任何装置、软件或例行程序干预或试图干预购免单平台的正常软件运作或正在进行的任何交易、活动。购免单会员的任何上述行为都将导致购免单有权立即停止对会员的会员服务并且注销相关用户，并赔偿造成的购免单平台的任何损失或者承担相应法律责任。\n购免单会员认可购免单平台在如下情形下，有权作如下处理:\n1、购免单有权对会员是否违反本协议承诺做出单方认定，并根据单方认定结果适用规则予以处理，这无需得到会员的同意和认可。\n2、经任何有权机构出具的法律文书确认会员存在违法或侵权行为，或者购免单平台判断认定会员存在涉嫌违反本协议和/或规则的条款或涉嫌违反法律法规的规定的，购免单平台有权单方面做出相关处罚。\n3、对于会员在购免单平台上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议和/或规则的信息以及购免单\n4、对于会员在购免单平台上对任意第三方造成损害的，相关会员均应当以自己的名义独立承担所有的法律责任。购免单平台因为会员行为承担责任或者赔偿相关损失(包括但不限与民事赔偿、行政处罚及其他形式的责任)，购免单平台将会对相关会员进行追责，追责索赔的范围包括但不限于调查取证费用以及相关的律师费等一切因为追责所产生的费用。\n5、购免单会员在使用购免单平台时或者在间接使用购免单平台时，使得购免单平台承担了任何意义上的索赔或者承担了任何的违约责任等任何损失。购免单会员应当赔偿购免单平台由此产生的一切损失，这些损失包括但不限于由此而发生的一切费用，这些费用包括但不限于调查费用、任何第三方机构费用和律师费等一切费用。\n7、购免单平台上展示的资料(包括但不限于文字、图表、标识、图像、数字下载和数据编辑)均为购免单平台或者其内容提供者的知识产权;上述知识产权均受法律保护。8、会员承诺在购免单平台上进行实名注册的账户为真实信息，如果因为购免单会员瑕疵信息或者虚假信息导致相关法律责任的，由实施相关注册的会员进行独立承担相应法律责任。如果由于会员的虚假、瑕疵注册导致购免单平台承担了相应责任的，购免单会员应当赔偿购免单平台由此产生的一切损失,这些损失包括但不限于由此而发生的-切费用，这些费用包括但不限于的调查费用、任何\n第三E方机构费用和律师费等一切费用。\n五、购免单平台作为平台的运作方,在运作购免单平台时享有如下权利，购免单会员以及相关合作商户认可购免单在运作相关平台时享有下列权利。\n1、购免单平台有权单方面认定会员或者合作商户是否违反本协议、购免单单方发布的规则以及相关法律法规。购免单有权立即按您的承诺或协议约定的方式对您的账户采取限制措施,包括中止或终止向您提供服务。--般情况下，除非法律法规另有明确要求，购免单平台无须就相关确认与您核对事实，相关处罚无需得到会员认可。\n2、购免单平台有权对会员注册、登记或者交易中记录的资料及数据信息等一切在购免单平台所产生的数据，独家的、永久的、免费的全球范围内使用并许可他人使用的权利。\n六、责任范围和责任限制\n1、购免单平台负责按目前的法律法规和银行提供的清算服务内容向会员提供服务，且购免单仅仅对仅对自身提供的服务承担责任，购免单平台不存在任何的资金托管和清算服务。购免单平台对于合作商户提供的服务和产品不提供保证也不承担任何责任,在必要情形下会协助会员和合作商户进行交涉谈判以维护会员以及合作商户的合法权益。\n购免单平台保留在法律法规或者银行清算服务发生变化的情况下，酌情决定是否停止服务的权利，购免单停止服务不承担任何法律责任。会员和和合作上商户之间的现金退款奖励和营业款清算，完全由第三方银行进行，与购免单平台无关。\n2、购免单会员了解且清楚，购免单平台上相关信息是其他会员或者合作商户自行发布，相关信息购免单平台无法在第一时间审核而产生一定的风险。购免单平台作为互联网平台，无法控制产品和服务的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。购免单会员在消费时应当应自行谨慎判断确定相关物品及/或信息的真实性、合法性和有效性，并自行承担相关风险。\n3、购免单平台所实施的现金退款奖励是建立合作商户的打折促销合作商户参与的购免单促销活动以及会员在购免单平台所获得等级，购免单会员参与相关活动视为愿意遵守相关机制,相关机制并不仅仅依赖于付款的先后顺序。但是相关现金退款奖励的及时性和成功性依赖于合作商户、支付机构、银行清算系统、购免单服务器等一-切众所周知的互联网技术客观因素所控制，由于自然灾害、黑客攻击以及政府政策(如银行系统被叫停清算服务的)所导致的任何购免单服务暂停导致的现金退款奖励无法完成或者相关服务发生滞后的，购免单平台不承担责任。\n4、购免单平台没有义务对所有用户的注册数据、商品(服务)信息、交易行为以及与交易有关的其它事项进行事先审查也没有任何义务确保相关数据、商品(服务)信息、交易行为的真实性。但是购免单平台有权在下列情况出现时进行审查:\na)购免单平台认为相关具体交易事项可能存在重大违法或违约情形(如洗钱、涉毒涉黄涉赌等违法行为)。\nb)购免单平台有理由认为会员在购免单平台上的行为涉嫌违法、不当或者违反公序良俗的情况。\n5、购免单平台不对因下述任--情况发生任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿:\na)第三方未经批准的使用您的账户或更改您的数据。b)您对购免单平台服务的错误认知。\nd)任何非因购免单平台的原因而引起的其它损失。\n6、因使用购免单平台服务而引起的任何损害或经济损失原则上购免单平台不承担任何责任。在特殊情况下如果购免单平台需要承担责任的均不超过您通过不超过所购买的或与该索赔有关的服务或商品的价格。本责任限制条款在会员资格被冻结、暂停或注销后仍继续有效。\n7、不论在何种情况，均不对由于罢工、暴乱、起义、骚乱、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令，以及其它非因购免单平台的原因而造成的不能服务或延迟服务承担责任。七、协议终止\n1、购免单平台有权依据本协议决定中止、终止向您提供部分或全部服务,暂时冻结或永久冻结(注销)您的账户，且无须为此向您或任何第三方承担任何责任。\n2、出现以下情况时，购免单平台有权直接注销账户:a)会员超过两年无登陆记录;\nb)提供的电子邮箱不存在或无法接收电子邮件、会员提供的手机号码错误或者非本人的手机号码，购免单平台在十个工作日内仍未更改为有效电子邮箱或者手机号码的;c)您注册信息中的内容不真实或不准确或不及时或不完整;\nd)本协议(含规则)变更时,您不愿接受新的服务协议的;e)其它购免单平台认为应当终止服务的情况。\n3、购免单会员同意，购免单平台会员与购免单平台协议终止或者停止各自服务后购免单平台依旧有权继续保存并使用您的注册、登记信息、数据等所有交易数据。八、隐私政策\n1、一个帐号仅限一个会员使用，会员必须提供真实确实的信息，对于由于资料提供不正确导致会员权利无法实现的，购免单平台不承担责任;\n2、会员资料修改后必须及时通知自吃猫平台做出相应变更;_\n3、购免单平台承诺除非在本协议约定的的情况下，购免单平台将不会向其它第三方机构透露会员涉及隐私的信息;5、会员必须遵守购免单平台现有的和将来可能具有的使用条款及隐私政策。\n九、法律适用、管辖与其他\n1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和(或)行业惯例。\n2、因本协议产生之争议,应依照中华人民共和国法律予以处理。双方对于争议协商不成的，应当提交河南仲裁委员会仲裁。'
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})